Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memr.tmx
Source language: ca
Languages: es

source: En particular, es parla d'interlingua quan la representació interna que s'obté de l'anàlisi és independent de quines siguen la LO i la LM, és a dir, la interlingua és { lingüísticament neutral}.
es: En particular, se habla deinterlingua cuando la representación interna que se obtiene del análisis es independiente de cuales sean la LO y la LM, es decir, la interlingua es lingüísticamente neutral}.

source: En quina de les tres fases d'un sistema de transferència s'usen els diccionaris bilingües?
es: ¿En cuál de las tres fases de un sistema de transferencia se usan los diccionarios bilingües?

source: En quins casos es ``trenquen'' sintagmes?
es: ¿En qué casos se ``rompen'' sintagmas?

source: En resum, la distribució no és gens homogènia: uns pocs mots són els més freqüents i la majoria són moltíssim menys freqüents.
es: En resumen, la distribución no es nada homogénea: unas pocas palabras son las más frecuentes y la mayoría son muchísimo menos frecuentes.

source: En un corpus de textos en espanyol sobre economia de 925.461 mots estudiem quan apareixen mots conjuntament.
es: En un corpus de textos en español sobre economía de 925.461 palabras estudiamos cuando aparecen palabras conjuntamente.

source: En un sistema de transferència morfològica En un sistema de transferència semàntica o d'interlingua clàssic.
es: En un sistema de transferencia morfológica En un sistema de transferencia semántica o de interlingua clásico.

source: En una oferta de treball, WorldTrans demana experts en swahili però no demana cap expert en traducció entre swahili i cap de les quinze llengües.
es: En una oferta de trabajo, WorldTrans pide expertos en swahili pero no pide ningún experto en traducción entre swahili y ninguno de las quince lenguas.

source: Encara pot ser nom o verb.
es: Todavía puede ser nombre o verbo.

source: Entrada restant
es: Entrada restante

source: Entre els tipus de sistemes de traducció automàtica indirectes, el primer que comença a aplicar, almenys parcialment, el principi de composicionalitat és el de transferència sintàctica, ja que construeix la traducció usant com a pas intermedi un arbre d'anàlisi sintàctica de l'oració original.
es: Entre los tipos de sistemas de traducción automática indirectas, el primero que empieza a aplicar, al menos parcialmente, el principio de composicionalidad es el de transferencia sintáctica, puesto que construye la traducción usando como paso intermedio un árbol de análisis sintáctico de la oración original.

source: Es açò possible?
es: ¿Es esto posible?

source: Es diu que un transductor de lletres és determinista quan $:Q L Q$, és a dir, quan totes les transicions que ixen d'un estat tenen etiquetes de transició diferents.
es: Se dice que un transductor de letras es determinista cuando $:Q L Q$, es decir, cuando todas las transiciones que salen de un estado tienen etiquetas de transición diferentes.

source: Es diu que una cadena de $w'^*$ és una transducció d'una cadena d'entrada $w^*$ quan hi ha almenys un camí des de l'estat inicial $q_I$ fins a un estat final en $F$ les etiquetes de transició del qual formen la parella $w:w'$ quan es concatenen.
es: Se dice que una cadena de $w'^*$ es una transducción de una cadena de entrada $w^*$ cuando hay al menos un camino desde el estado inicial $q_I$ hasta un estado final en $F$ las etiquetas de transición del cual forman la pareja $w:w'$ cuando se concatenan.

source: Es pot demostrar que, a pesar de ser menys freqüents, ``precio máximo'' o ``algunos sectores'' també tendeixen a estar junts per damunt de l'atzar, pot ser per ser col·locacions pròpies del tema econòmic.
es: Se puede demostrar que, a pesar de ser menos frecuentes, ``precio máximo'' o ``algunos sectores'' también tienden a estar juntos por encima del azar, puede ser para ser colocaciones propias del tema económico.

source: Es vol construir un sistema de traducció automàtica que traduïsca entre qualssevol dues llengües del grup format pel portugués, el gallec, el català, l'espanyol i l'italià.
es: Se quiere construir un sistema de traducción automática que traduzca entre cualquiera de las dos lenguas del grupo formado por el portugués, el gallego, el catalán, el español y el italiano.

source: Escriure una gramàtica que cobrisca completament totes les possibles frases sintàcticament correctes d'una llengua és una tasca que està molt lluny de ser trivial.
es: Escribir una gramática que cubra completamente todas las posibles frases sintácticamente correctas de una lengua es una tarea que está muy lejos de ser trivial.

source: Especifica completament dues regles (indicant possibles reordenaments i operacions per a assegurar la concordança) que permeten donar la traducció correcta de les oracions de dalt i de les següents.
es: Especifica completamente dos reglas (indicando posibles reordenamientos y operaciones para asegurar la concordancia) que permiten dar la traducción correcta de las oraciones de arriba y de las siguientes.

source: Estudieu els següents sintagmes nominals en maori (una llengua polinèsia parlada en Nova Zelanda):
es: Estudiad los siguientes sintagmas nominales en maori (una lengua polinesia hablada en Nueva Zelanda):

source: Evidentment, no sempre s'han de moure els adjectius; la traducció correcta de ``the last car'' és ``l'últim cotxe'', sense canviar l'ordre.
es: Evidentemente, no siempre se tienen que mover los adjetivos; la traducción correcta de ``the last car'' és ``l'últim cotxe'', sin cambiar el orden.

source: Finalment, la fase de generació transforma aquesta representació en la frase en LM.
es: Finalmente, la fase de generación transforma esta representación en la frase en LM.

source: Fins i tot, podria ser similar a una llengua humana.
es: Incluso, podría ser similar a una lengua humana.

source: Fixeu-vos en aquests dos exemples, on s'ha fet una anàlisi sintàctica parcial per a marcar els sintagmes nominals amb claudàtors: $${ll}
es: Fijaos en estos dos ejemplos, donde se ha hecho un análisis sintáctico parcial para marcar los sintagmas nominales con corchetes: $${ll}

source: Fixeu-vos en els exemples i digueu quins són els patrons que detecta i quines les regles de reordenament associades.
es: Fijaos en los ejemplos y decid cuáles son los patrones que detecta y cuáles las reglas de reordenamiento asociadas.

source: Fixeu-vos en la taula de freqüències d'aparició d'alguns parells.
es: Fijaos en la tabla de frecuencias de aparición de algunos pares.

source: Fixeu-vos en les frases espanyoles següents i les traduccions al català fetes per un sistema que usa aquesta estratègia i deduïu quines són les seqüències que detecta i quines no.
es: Fijaos en las frases españolas siguientes y las traducciones al catalán hechas por un sistema que usa esta estrategia y deducid cuáles son las secuencias que detecta y cuales no.

source: Fixeu-vos que la traducció automàtica basada en exemples pot necessitar que la mostra de frases i traduccions estiga, a més, anotada lingüísticament (en l'exemple, indicant quins mots o estructures funcionen com un nom).
es: Fijaos que la traducción automática basada en ejemplos puede necesitar que la muestra de frases y traducciones esté, además, anotada lingüísticamente (en el ejemplo, indicando qué palabras o estructuras funcionan como un nombre).

source: Heu d'indicar tres tipus diferents de canvi.
es: Tenéis que indicar tres tipos diferentes de cambio.

source: Heus ací algunes frases espanyoles amb { cuyo}, les traduccions produïdes per CasCat, i, on la traducció és incorrecta, una alternativa acceptable.
es: He aquí algunas frases españolas con { cuyo}, las traducciones producidas por CasCat, y, donde la traducción es incorrecta, una alternativa aceptable.

source: Hi ha diverses aproximacions a la traducció automàtica basada en corpus.
es: Hay varias aproximaciones a la traducción automática basada en corpus.

source: Hi ha més exemples interessants: en anglés sink (enfonsar) és un verb ergatiu: quan porta subjecte i objecte, no és especial: el subjecte és l'agent i l'objecte el pacient: we sank the ship, però quan porta només un subjecte, aquest correspon al pacient de l'acció: the ship sinks.
es: Hay más ejemplos interesantes: en inglés sink (enfondar) es un verboergativo: cuando lleva sujeto y objeto, no es especial: el sujeto es el agente y el objeto el paciente: we sank the ship,pero cuando lleva sólo un sujeto, este corresponde al paciente de la acción: the ship sinks.

source: Ho fan aplicant transformacions a l'arbre d'anàlisi sintàctica (transferència estructural) i substituint els mots (transferència lèxica), sense construir una representació explícita de la interpretació.
es: Lo hacen aplicando transformaciones al árbol de análisis sintáctico (transferencia estructural) y sustituyendo las palabras (transferencia léxica), sin construir una representación explícita de la interpretación.

source: I hi ha a la vista
es: Y hay a la vista

source: I pot complicar-se més.
es: Y puede complicarse más.

source: Imaginem el sintagma nominal següent en anglés: ``The old professor's smart girlfriend's red car''; el sintagma és massa llarg per a la major part dels programes de transferència morfològica, perquè involucra una seqüència massa llarga de reordenament.
es: Imaginemos el sintagma nominal siguiente en inglés: ``The old professor's smart girlfriend's red car''; el sintagma es demasiado largo para la mayor parte de los programas de transferencia morfológica, porque involucra una secuencia demasiado larga de reordenamiento.

source: Imaginem que seguim aquest mètode amb el mot angoixaven: Quan només hem vist ang- hi ha encara moltes possibilitats: pot ser, entre altres, qualsevol forma dels mots angina, angle, anglés, angoixa, angoixar, angost, { anguila} i angula.
es: Imaginemos que seguimos este método con la palabra angoixaven: Cuando sólo hemos visto ang- todavía hay muchas posibilidades: puede ser, entre otras, cualquier forma de las palabras angina, angle, anglés, angoixa, angoixar, angost, { anguila} y angula.

source: Imaginem que volem traduir de l'anglés al català i hem decidit que s'han d'usar aquestes regles de reordenament: [$R_1$] adj subst $$ subst adj [$R_2$] subst$_1$ subst$_2$ $$ { subst}$_2$ prepde subst$_1$ Per exemple, la regla $R_1$ reordenaria ``tall driver'' en ``conductor alt'' i la regla $R_2$ reordenaria ``truck driver'' en ``conductor de camió''.
es: Imaginemos que queremos traducir del inglés al catalán y hemos decidido que se tiene que usar estas reglas de reordenamiento: [$R_1$] adj sust $$ sust adj [$R_2$] sust$_1$ sust$_2$ $$ { sust}$_2$ prepde sust$_1$ Por ejemplo, la regla $R_1$ reordenaría ``tall driver'' en ``conductor alto'' y la regla $R_2$ reordenaría ``truck driver'' en ``conductor de camión''.

source: Imaginem tres llengües que anomenarem $L_1$, $L_2$ i $L_3$.
es: Imaginemos tres lenguas que denominaremos $L_1$, $L_2$ i $L_3$.

source: Imagineu que sou part d'un equip de desenvolupament d'un sistema de traducció automàtica de l'anglés al català basat en l'estrategia que hem anomenat a classe transferència morfològica avançada (apartat ).
es: Imaginad que sois parte de un equipo de desarrollo de un sistema de traducción automática del inglés al catalán basado en la estrategia que hemos denominado en clase transferencia morfológica avance (apartado ).

source: Imagineu que sou part d'un equip de desenvolupament d'un sistema de traducció automàtica del maori al català (o a l'espanyol) basat en l'estrategia que hem anomenat a classe transferència morfològica avançada.
es: Imaginad que sois parte de un equipo de desarrollo de un sistema de traducción automática del maori al catalán (o al español) basado en el estrategia que hemos denominado en clase transferencia morfológica avance.

source: Imagineu que tenim un sistema de transferència morfològica avançada que tradueix d'interlingua al català (o a l'espanyol) usant aquestes quatre regles: [$R_1$] detecta det--n i escriu trad(det)--trad(n), fent concordar trad(det) en gènere i en nombre amb trad(n) [$R_2$] detecta det--n--adj i escriu trad(det)--trad(n)-trad(adj), fent concordar trad(det) i trad(adj)en gènere i en nombre amb trad(n) [$R_3$] detecta n--adj i escriu trad(n)--trad(adj), fent concordar trad(adj) en gènere i en nombre amb trad(n) [$R_4$] detecta adj--n i escriu trad(n)--trad(adj), fent concordar trad(adj) en gènere i en nombre amb trad(n) Si no es pot usar informació de concordança, la traducció dels determinants i els adjectius es fa en masculí singular.
es: Imaginad que tenemos un sistema de transferencia morfológico avanzado que traduce de interlingua al catalán (o al español) usando estas cuatro reglas: [$R_1$] detecta det--n y escribe trad(det)--trad(n), haciendo concordar trad(det) en género y en número con trad(n) [$R_2$] detecta det--n--adj y escribe trad(det)--trad(n)-trad(adj), haciendo concordar trad(det) y trad (adj)en género y en número con trad(n) [$R_3$] detecta n--adj y escribe trad(n)--trad(adj), haciendo concordar trad(adj) en género y en número con trad(n) [$R_4$] detecta adj--n y escribe trad(n)--trad(adj), haciendo concordar trad(adj) en género y en número con trad(n) Si no se puede usar información de concordancia, la traducción de los determinantes y los adjetivos se hace en masculino singular.

source: Imagineu que teniu un sistema de traducció automàtica que treballa amb dues llengües, diguem-ne $A$ i $B$, en els dos sentits de traducció: $A{}B$ i $B{}A$, que traduïm un text origen $T$ en llengua $A$ a la llengua $B$ mitjançant aquest traductor automàtic, generant un text $T'$, i que després usem aquest mateix sistema per a traduir $T'$ de nou a la llengua $A$; anomenarem $T''$ el nou text en llengua $A$.
es: Imaginad que tenéis un sistema de traducción automática que trabaja con dos lenguas, digamos $A$ y $B$, en los dos sentidos de traducción: $A B${}y $B{}A$, que traducimos un texto origen $T$ en lengua $A$ a la lengua $B$ mediante este traductor automático, generando un texto $Te $, y que después usamos este mismo sistema para traducir $Te $ de nuevo a la lengua $A$; denominaremos $Te '$ el nuevo texto en lengua $A$.

source: Indica quina d'aquestes afirmacions és certa.
es: Indica cuál de estas afirmaciones es cierta.

source: Indica quina d'aquestes afirmacions és falsa.
es: Indica cuál de estas afirmaciones es falsa.

source: Indica quines traduccions al català (o a l'espanyol) produirà aquest sistema per a les frases següents i per què: Un longe viage Un longe viages Un viages longe Longe viages Un governamento non democratic Un governamentos non democratic Tu melior ideales Un bon solution
es: Indica qué traducciones al catalán (o al español) producirá este sistema para las frases siguientes y por qué: Un longe viage Un longe viages Un viages longe Longe viages Un governamentos non democratic Un governamentos non democratic Tu melior ideales Un bon solution

source: Indiqueu en quin (o quins) tipus de sistema de traducció automàtica trobem un disseny que aplica, exactament o aproximadament, el principi de composicionalitat.
es: Indicad en qué (o qué) tipo de sistema de traducción automática encontramos un diseño que aplica, exactamente o aproximadamente, el principio de composicionalidad.

source: Indiqueu quines serien les 3 regles que proposaríeu, tenint en compte que han de produir, com a mínim, tres oracions ben traduïdes en el corpus d'oracions seguents (la traducció ideal s'indica entre parèntesi, tot i que no sempre podrà ser aconseguida):
es: Indicad cuáles serían las 3 reglas que propondríais, teniendo en cuenta que tienen que producir, como mínimo, tres oraciones muy traducidas en el corpus de las oraciones siguientes (la traducción ideal se indica entre paréntesis, a pesar de que no siempre podrá ser conseguida):

source: Interlingua, a més de ser el nom de la representació intermèdia dels sistemes indirectes sense transferència, és el d'una llengua artificial bàsicament d'arrel llatina, amb una flexió simplificada, i amb un vocabulari dissenyat per a ser comprensible a molts europeus.
es: Interlingua, además de ser el nombre de la representación intermedia de los sistemas indirectos sin transferencia, es el de una lengua artificial básicamente de raíz latina, con una flexión simplificada, y con un vocabulario diseñado para ser comprensible a muchos europeos.

source: Ja podem dir que el lema comença per { ango}.
es: Ya podemos decir que el lema comienza por { ango}.

source: Justifiqueu la resposta.
es: Justificad la respuesta.

source: Justifiqueu la vostra resposta.
es: Justificad vuestra respuesta.

source: L'anàlisi morfològica és el procés que determina, per a cada mot d'un text (forma superficial o flexionada) una o diverses formes lèxiques , consistents en una forma canònica o lema i informació sobre la categoria lèxica del mot i la flexió (vegeu la secció ).
es: Elanálisis morfológico es el proceso que determina, para cada palabra de un texto (forma superficial o flexionada) una o diversas formas léxicas , consistentes en una forma canónica o lema e información sobre la categoría léxica de la palabra y la flexión (mirad la sección ).

source: L'acció pertinent és
es: La acción pertinente es

source: L'analitzador ens pot dir ja { angoixar<verb>­<impind>}.
es: El analizador nos puede decir ya { angoixar<verb>­<impind>}.

source: L'analitzador llig la forma superficial lletra per lletra, va d'estat en estat, i va produint la forma lèxica, fins que llig tot el mot; si arriba a un estat final, accepta el mot i en retorna la forma lèxica.
es: El analizador lee la forma superficial letra por letra, va de estado en estado, y va produciendo la forma léxica, hasta que lee toda la palabra; si llega a un estado final, acepta la palabra y devuelve la forma léxica.

source: L'analitzador produeix: { angoixar<verb><impind><3><pl>}.
es: El analizador produce: { angoixar<verb><impind><3><pl>}.

source: L'anàlisi del text origen és tan profunda en els sistemes d'interlingua clàssics que no és necessària la transferència.}
es: El análisis del texto origen es tan profundo en los sistemas de interlingua clásicos que no es necesaria la transferencia.}

source: L'anàlisi morfològica pren una oració i... ... produeix un arbre d'anàlisi.
es: El análisis morfológico toma una oración y... ... produce un árbol de análisis.

source: L'anàlisi sintàctica s'explica amb més detall en l'apartat .
es: El análisis sintáctico se explica con más detalle en el apartado .

source: L'arquitectura de transferència té dues característiques interessants que mereixen ser esmentades: D'una banda, la modularitat.
es: La arquitectura de transferencia tiene dos características interesantes que merecen ser nombradas: Por una parte, la modularidad.

source: L'elecció de la profunditat de l'anàlisi s'ha de fonamentar en la naturalesa i la profunditat de les divergències de traducció {vandooren93b} entre les llengües implicades.
es: La elección de la profundidad del análisis se tiene que fundamentar en la naturaleza y la profundidad de las divergencias de traducción {vandooren93b} entre las lenguas implicadas.

source: L'estat inicial, indicat amb una fletxa entrant, és el situat més a l'esquerra en el graf.}
es: El estado inicial, indicado con una flecha entrante, es el situado más a la izquierda en el grafo.}

source: L'estratègia directa s'anomena així perquè la traducció d'una frase es produeix directament, sense que es genere una representació intermèdia de la frase; de vegades també se sol anomenar vagament traducció mot per mot.
es: La estrategia directa se llama así porque la traducción de una frase se produce directamente, sin que se genere una representación intermedia de la frase; a veces también se suele llamar vagamente traducción palabra por palabra.

source: L'estratègia indirecta produeix, a partir de la frase en la llengua d'origen (LO), una representació intermèdia de la frase que després s'usa per a traduir-la.
es: La estrategia indirecta produce, a partir de la frase en la lengua origen (LO), una representación intermedia de la frase que después se usa para traducirla.

source: L'estratègia de transferència sintàctica resol una bona part dels problemes dels sistemes directes i dels de transferència morfològica, ja que és capaç de determinar l'extensió i l'estructura de cada un dels sintagmes de la frase en LO i manipular cada sintagma com una unitat, independentment de l'estructura o de la longitud.
es: La estrategia de transferencia sintáctica resuelve una buena parte de los problemas de los sistemas directos y de los de transferencia morfológica, ya que es capaz de determinar la extensión y la estructura de cada uno de los sintagmas de la frase en LO y manipular cada sintagma como una unidad, independientemente de la estructura o de la longitud.

source: L'estratègia directa es correspon molt bé amb la que s'usa en els programes de traducció automàtica de primera generació (decenni de 1950).
es: La estrategia directa se corresponde muy bien con la que se usa en los programas de traducción automática de primera generación (decenio de 1950).

source: L'ús de la taula permet construir el programa analitzador independentment de la gramàtica concreta: si canvia la gramàtica, només canvia la taula.
es: El uso de la tabla permite construir el programa analizador independientemente de la gramática concreta: si cambia la gramática, sólo cambia la tabla .

source: La capacitat d'un sistema de transferència morfològica per a produir traduccions acceptables dependrà de la seua capacitat per a detectar seqüències de mots que es corresponguen amb els sintagmes que necessiten ser reordenats.
es: La capacidad de un sistema de transferencia morfológica para producir traducciones aceptables dependerá de su capacidad para detectar secuencias de palabras que se correspondan con los sintagmas que necesitan ser reordenados.

source: La chica cuyos compañeros de clase de francés murieron es china *La noia els companys de classe de la qual de francès van morir és xinesa (La noia els companys de classe de francès de la qual van morir és xinesa)
es: La chica cuyos compañeros de clase de francés murieron es china *La noia els companys de classe de la qual de francés van morir és xinesa (La noia els companys de classe de francés de la qual van morir és xinesa

source: La divisió en mòduls o etapes ben diferenciades (anàlisi, transferència i generació) en permet la reutilització.
es: La división en módulos o etapas bien definidas (análisis, transferencia y generación) permite la reutilización.

source: La fase de generació podria efectuar la substitució de les formes lèxiques de la LM per les corresponents formes superficials.
es: La fase de generación podría efectuar la sustitución de las formas léxicas de la LM por las correspondientes formas superficiales.

source: La fase de transferència pot consistir en un reordenament local (transferència estructural) d'algunes seqüències de mots (per exemple, quan es tradueix de l'anglés al català, els parells adjectiu--substantiu es podrien reordenar a substantiu--adjectiu) i en la conversió de les formes lèxiques de la LO en les corresponents de la LM mitjançant l'ús d'un diccionari bilingüe (transferència lèxica).
es: La fase de transferencia puede consistir en un reordenamiento local (transferencia estructural) de algunas secuencias de palabras (por ejemplo, cuando se traduce del inglés al catalán, los pares adjetivo--sustantivo se podrían reordenar a sustantivo--adjetivo) y en la conversión de las formas léxicas de la LO en las correspondientes de la LM mediante el uso de un diccionario bilingüe (transferencia léxica).

source: La figura il·lustra el cost d'afegir $L_4$ al sistema.
es: La figura ilustra el coste de añadir $L_4$ al sistema.
